[Demo_Destiny_ep5_1 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=4522,Y=-4619,Z=95),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=180,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=4332,Y=-4619,Z=-40),VecSub=(X=0,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Fountain.GG2_AMB_Fountain_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_001_Cue',Name="エコロ")
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[13]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[15]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[16]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_003_Cue',Name="エコロ")
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[18]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[19]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[20]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Pressure_Cue')
DemoScripts[21]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=1,CId=71)
DemoScripts[22]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=0,Number=1,Bit=0)
DemoScripts[23]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0103_fx_Stand2Furry",Rate=0,Number=2,Bit=0)
DemoScripts[24]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0300_lp_Furry",Number=8)
DemoScripts[25]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_005_Cue',Name="エコロ")
DemoScripts[26]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[27]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[28]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0301_fx_Furry2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[29]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[30]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_006_Cue',Name="エコロ")
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[32]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[33]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[34]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",Rate=0,Number=0,Bit=1)
DemoScripts[35]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[36]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0002_fx_close_smile_S",Rate=0,Number=1,Bit=0)
DemoScripts[37]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_009_Cue',Name="エコロ")
DemoScripts[38]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[39]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[40]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_010_Cue',Name="エコロ")
DemoScripts[41]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[42]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[43]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[44]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_012_Cue',Name="エコロ")
DemoScripts[45]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[46]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[47]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_013_Cue',Name="エコロ")
DemoScripts[48]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[49]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[50]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[51]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_014_Cue',Name="エコロ")
DemoScripts[52]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[53]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[54]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[55]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",Rate=0,Number=0,Bit=1)
DemoScripts[56]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_016_Cue',Name="エコロ")
DemoScripts[57]=(Actor=TEXT,Command=SET,ID=TEXT16)
DemoScripts[58]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[59]=(Actor=TEXT,Command=SET,ID=TEXT17)
DemoScripts[60]=(Actor=TEXT,Command=SET,ID=TEXT18)
DemoScripts[61]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0101_lp_close_smile",Rate=0,Number=0,Bit=1)
DemoScripts[62]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep5_1.GG2_V_DES_ep5_1_019_Cue',Name="エコロ")
DemoScripts[63]=(Actor=TEXT,Command=SET,ID=TEXT19)
DemoScripts[64]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[65]=(Actor=WINDOW,Command=EXIT)
DemoScripts[66]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[67]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[68]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[69]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[70]=(Actor=SYSTEM,Command=END)

[Select_Destiny_ep5_1 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Destiny_ep5_1 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="唉......")

Texts[1]=(Label="TEXT02",Name="峯大",Text="妳為什麼在嘆氣啊?")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="不......到了這個地步,/n我還是陷入了自問自答,/n想著為什麼自己在做這種事情......")

Texts[3]=(Label="TEXT04",Name="峯大",Text="不就是因為妳出了差錯嗎......")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="我不就說了,/n那是惡魔害的嗎!")

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="當時要是惡魔沒有來阻撓的話,/n現在峯大大人就會享受著剛剛好的桃花期,/n而我也已經確定可以畢業才對......")

Texts[6]=(Label="TEXT07",Name="峯大",Text="這麼說來,這是畢業考對吧?/n艾可蘿是國中生?")

Texts[7]=(Label="TEXT08",Name="峯大",Text="雖然不知道天使有沒有/n國中或高中之類的就是了......")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="是的.我就讀的是/n天使學校的中等部./n當然也是有高等部的唷.")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="到中等部為止是義務教育,這部分/n和這個國家相同,在那之後有升學到/n高等部的天使,也有選擇就職的天使呢.")

Texts[10]=(Label="TEXT11",Name="峯大",Text="這樣啊./n艾可蘿要升學嗎?")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="我是這麼打算的./n因為我作為一個天使/n對將來還沒有明確的夢想.")

Texts[12]=(Label="TEXT13",Name="艾可蘿",Text="我想要一邊唸高中,一邊摸索/n自己想做什麼,還有自己能做什麼.")

Texts[13]=(Label="TEXT14",Name="艾可蘿",Text="現在是為了家裡的面子/n而做著邱比特的工作,但是搞不好/n將來會擔任完全無關的職位呢.")

Texts[14]=(Label="TEXT15",Name="峯大",Text="原來如此啊./n天使也會有各式各樣的煩惱,/n經歷青春時期呢.")

Texts[15]=(Label="TEXT16",Name="艾可蘿",Text="你很意外嗎?")

Texts[16]=(Label="TEXT17",Name="峯大",Text="算是吧./n不過我也因此覺得/n自己該努力了哦.")

Texts[17]=(Label="TEXT18",Name="峯大",Text="就算是為了艾可蘿,/n也要盡快找到命運的戀人才行呢.")

Texts[18]=(Label="TEXT19",Name="艾可蘿",Text="峯大大人....../n好的! 打起精神來前進吧!")

Texts[19]=(Label="",Name="",Text="")

Texts[20]=(Label="SELECT01",Name="",Text="")

Texts[21]=(Label="SELECT02",Name="",Text="")

Texts[22]=(Label="SELECT03",Name="",Text="")

Texts[23]=(Label="SELECT04",Name="",Text="")

Texts[24]=(Label="SELECT05",Name="",Text="")

Texts[25]=(Label="SELECT06",Name="",Text="")

Texts[26]=(Label="SELECT07",Name="",Text="")

Texts[27]=(Label="SELECT08",Name="",Text="")

Texts[28]=(Label="SELECT09",Name="",Text="")

Texts[29]=(Label="SELECT10",Name="",Text="")


